app/views/articles/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 19]]
SELECT 1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1 LIMIT $2  [["article_id", 19], ["LIMIT", 1]]
---
          <%= link_to gravatar_for(@article.user , size: 150) , user_path(@article.user.id) , method: :get %>
          <% if @article.categories.any? %>