app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hello John"], ["description", "Holla Holla"], ["created_at", "2021-02-22 04:27:31.660680"], ["updated_at", "2021-02-22 04:27:31.660680"], ["user_id", 10]]