app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    @articles = @category.articles.paginate(page: params[:page] , per_page: 5)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1 LIMIT $2 OFFSET $3  [["category_id", 1], ["LIMIT", 5], ["OFFSET", 0]]