app/views/categories/index.html.erb

            <h5 class="card-title"><%= link_to category.name , category_path(category.id) , class: "text-success" %></h5>
            <p class="card-text"><%= pluralize(category.articles.count , "article") %></p>
---
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1  [["category_id", 1]]

            <small>
              edited <%= time_ago_in_words(category.created_at) %> ago ,
              updated <%= time_ago_in_words(category.updated_at) %> ago
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Travel"], ["created_at", "2021-02-22 09:07:07.249618"], ["updated_at", "2021-02-22 09:07:07.249618"]]